; domain
(define (domain ER-domain)
    (:requirements :strips)
    (:predicates    (at ?x ?y) (adj ?x ?y) (rob ?x)
                    (busy ?x) (person ?x) (request ?x ?y ?z) (conv ?topic) 
                    (Pdata ?patient-data ?loc) (issue ?x) (Preq ?patient-request) (req-done ?patient-request)
                    (Pwater ?water) (move-with-human ?patient-request ?to) (time4appt ?appt-time)
                    (moving-together ?moved) (return-robot ?return) (robot-home ?patient-request))

    (:action move-robot
        :parameters (?robot ?from ?to)
        :precondition (and (at ?robot ?from)
        		       (adj ?from ?to)
                       (rob ?robot)
                       (not (busy ?to)))
                       
        :effect (and (not (at ?robot ?from)) 
                          (at ?robot ?to)))
                          
    (:action move-human
        :parameters (?human ?from ?to)
        :precondition (and (at ?human ?from)
        		       (adj ?from ?to)
                       (person ?human)
                       (not (busy ?to)))
                       
        :effect (and (not (at ?human ?from)) 
                          (at ?human ?to)))

    (:action move-human-robot
        :parameters (?human ?robot ?from ?to ?accompany ?moved)
        :precondition (and  (at ?human ?from)
                            (at ?robot ?from)
            		        (adj ?from ?to)
                            (person ?human)
                            (rob ?robot)
                            (moving-together ?moved)
                            (not (busy ?to)))
                       
        :effect (and        (not (at ?human ?from)) 
                            (not (at ?robot ?from))
                            (at ?robot ?to)
                            (at ?human ?to)))

    (:action speak
        :parameters (?robot ?topic  ?human ?loc)
        :precondition (and (at ?robot ?loc)
                           (at ?human ?loc)
                           (rob ?robot)
                           (person ?human)
                           (conv ?topic)
                           (not (request ?robot ?human ?topic)))
        :effect (and (request ?robot ?human ?topic)))
        
    (:action listen
        :parameters (?human ?topic ?robot ?loc)
        :precondition (and (at ?robot ?loc)
                           (at ?human ?loc)
                           (rob ?robot)
                           (person ?human)
                           (conv ?topic)
                           (request ?robot ?human ?topic)
                           (not (request ?human ?robot ?topic)))
        :effect (and (request ?human ?robot ?topic)))

    (:action resolve-issue
        :parameters (?problem ?robot ?topic ?human ?loc)
        :precondition (and (at ?robot ?loc)
                           (at ?human ?loc)
                           (rob ?robot)
                           (person ?human)
                           (issue ?problem)
                           (request ?human ?robot ?topic))
        :effect (and (not (issue ?problem))))
           
    (:action get-patient-data
        :parameters (?patient-data ?robot ?topic ?human ?loc)
        :precondition (and (at ?robot ?loc)
                           (at ?human ?loc)
                           (rob ?robot)
                           (person ?human)
                           (not (Pdata ?patient-data ?loc))
                           (request ?human ?robot ?topic))
        :effect (and (Pdata ?patient-data ?loc)))
        
    ; (:action resolve-request
    ;     :parameters (?robot ?patient-request ?to) ; ?return)
    ;     :precondition (and  (rob ?robot)
    ;                         ; (return-robot ?return)
    ;                         (move-with-human ?patient-request ?to)
    ;                         (not (req-done ?patient-request))
    ;                         )
    ;     :effect (and    (req-done ?patient-request)))   


    (:action return-home
        :parameters (?robot ?patient-request ?to ?return) ; ?at-home)
        :precondition (and  (rob ?robot)
                            (return-robot ?return)
                            ; (at ?robot ?return)
                            (at ?robot ?to)
                            (adj ?to ?return)
                            (not (busy ?return))
                            (req-done ?patient-request)
                            (not (robot-home ?patient-request))
                            ; (not (req-done ?patient-request ?return))
                            )
        :effect (and    (robot-home ?patient-request)
                        (at ?robot ?return)
                        (not (at ?robot ?to))
                        ))  
        
          
    (:action take-patient2doc
        :parameters (?robot ?human ?from ?to ?patient-request ?appt-time) ; ?patient-data ?loc)
        :precondition (and (rob ?robot)
                          (person ?human)
                          (at ?robot ?from)
                          (at ?human ?from)
                          (adj ?from ?to)
                          (not (busy ?to))
                          (time4appt ?appt-time)
                        ;   (not (req-done ?accompany))
                        ;   (not (Preq ?accompany))
                          )
                        ;   (Pdata ?patient-data ?loc))
        :effect (and    (move-with-human ?patient-request ?to)
                        (not (time4appt ?appt-time))
                        ; (moving-together ?moved)
                        (not (at ?human ?from)) 
                        (not (at ?robot ?from)) 
                        (at ?robot ?to)
                        (at ?human ?to)
                        (req-done ?patient-request)
                        ; (Preq ?accompany)
                        ))          


    ; (:action get-water
    ;     :parameters (?loc ?robot  ?human ?want-water ?water ?Wloc ?request-done)
    ;     :precondition (and (rob ?robot)
    ;                       (person ?human)
    ;                       (Pwater ?water)
    ;                       (Preq ?want-water)
    ;                       (not (req-done ?request-done))
    ;                       (at ?robot ?Wloc)
    ;                       (at ?water ?Wloc)
    ;                       (not (at ?water ?loc)))
    ;     :effect (and (at ?water ?loc)
    ;                 (at ?robot ?loc)
    ;                 (req-done ?request-done)))                   
                     
)

; problem
(define (problem ER-problem-patient2doc)
    (:domain ER-domain)
    (:objects   main-enterance
                main-admission
                main-corridor
                main-triage
                
                waiting-room
                bathrooms-patients
                bathrooms-staff
                staff-lounge
                storage-equipment
                admin-checkout
                
                ambulance-enterance
                ambulance-admission
                ambulance-triage
                ambulance-corridor
                
                consulting-room-1
                consulting-room-2
                consulting-room-3
                consulting-room-4
                consulting-corridor
                
                bed-1 bed-2 bed-3
                bed-4 bed-5 bed-6
                bed-7
                bed-corridor
                
                examination-xray
                operating-room
                operating-corridor
                
                
                robot
                human
                error2solve
                topic
                patient-data
                request-done
                patient-request
                water
                accompany
                appt-time
                done-patient2doc
                )

    (:init  (adj main-corridor main-admission) (adj main-admission main-corridor)
            (adj main-corridor admin-checkout) (adj admin-checkout main-corridor)
            (adj main-corridor main-triage) (adj main-triage main-corridor) 
            (adj main-corridor main-enterance) (adj main-enterance main-corridor) 
            (adj main-corridor waiting-room) (adj waiting-room main-corridor) 
            (adj main-corridor bathrooms-patients) (adj bathrooms-patients main-corridor)
            
            (adj waiting-room bathrooms-patients) (adj bathrooms-patients waiting-room)
            (adj bathrooms-staff staff-lounge) (adj staff-lounge bathrooms-staff)
            (adj main-admission admin-checkout) (adj admin-checkout main-admission)
            
            (adj main-corridor ambulance-corridor) (adj ambulance-corridor main-corridor)
            (adj ambulance-corridor consulting-corridor) (adj consulting-corridor ambulance-corridor)
            (adj consulting-corridor operating-corridor) (adj operating-corridor consulting-corridor)
            (adj operating-corridor bed-corridor) (adj bed-corridor operating-corridor)
            (adj bed-corridor ambulance-corridor) (adj ambulance-corridor bed-corridor)
            
            (adj ambulance-corridor ambulance-triage) (adj ambulance-triage ambulance-corridor)
            (adj ambulance-corridor storage-equipment) (adj storage-equipment ambulance-corridor)
            (adj ambulance-corridor ambulance-enterance) (adj ambulance-enterance ambulance-corridor)
            (adj ambulance-corridor ambulance-admission) (adj ambulance-admission ambulance-corridor)
            (adj ambulance-corridor bathrooms-staff) (adj bathrooms-staff ambulance-corridor)
            (adj ambulance-corridor staff-lounge) (adj staff-lounge ambulance-corridor)
            
            (adj consulting-corridor consulting-room-1) (adj consulting-room-1 consulting-corridor)
            (adj consulting-corridor consulting-room-2) (adj consulting-room-2 consulting-corridor)
            (adj consulting-corridor consulting-room-3) (adj consulting-room-3 consulting-corridor)
            (adj consulting-corridor consulting-room-4) (adj consulting-room-4 consulting-corridor)
            (adj consulting-corridor examination-xray) (adj examination-xray consulting-corridor)
            (adj consulting-corridor operating-room) (adj operating-room consulting-corridor)
            
            (adj operating-corridor examination-xray) (adj examination-xray operating-corridor)
            (adj operating-corridor operating-room) (adj operating-room operating-corridor)
            
            (adj examination-xray storage-equipment) (adj storage-equipment examination-xray)
            
            (adj bed-corridor bed-1) (adj bed-1 bed-corridor)
            (adj bed-corridor bed-2) (adj bed-2 bed-corridor)
            (adj bed-corridor bed-3) (adj bed-3 bed-corridor)
            (adj bed-corridor bed-4) (adj bed-4 bed-corridor)
            (adj bed-corridor bed-5) (adj bed-5 bed-corridor)
            (adj bed-corridor bed-6) (adj bed-6 bed-corridor)
            (adj bed-corridor bed-7) (adj bed-7 bed-corridor)
            (adj bed-corridor examination-xray) (adj examination-xray bed-corridor)
            (adj bed-corridor operating-room) (adj operating-room bed-corridor)
            
            (busy bed-2) (busy bed-6) (busy consulting-room-3) (busy bathrooms-patients)
            
            (at human waiting-room) 
            (person human)
            
            (at robot main-triage)
            (rob robot)
            
            (conv topic)
            (issue error2solve)

            (time4appt appt-time)
            
            (Pwater water)
            (at water storage-equipment)
            (return-robot main-triage)
            )

    (:goal (and (Pdata patient-data waiting-room)
                (move-with-human accompany consulting-room-1)
                ; (req-done accompany)
                ; (robot-home accompany)
                
                ; (at robot consulting-room-1)
                ; (at human consulting-room-1)
                )))

; plan
1. (move-robot robot main-triage main-corridor)
   deleted: (at robot main-triage)
   added: (at robot main-corridor)
   goals met: 0 of 2
2. (move-robot robot main-corridor waiting-room)
   deleted: (at robot main-corridor)
   added: (at robot waiting-room)
   goals met: 0 of 2
3. (speak robot topic human waiting-room)
   added: (request robot human topic)
   goals met: 0 of 2
4. (listen human topic robot waiting-room)
   added: (request human robot topic)
   goals met: 0 of 2
5. (get-patient-data patient-data robot topic human waiting-room)
   added: (pdata patient-data waiting-room)
   goals met: 1 of 2
6. (move-human human waiting-room main-corridor)
   deleted: (at human waiting-room)
   added: (at human main-corridor)
   goals met: 1 of 2
7. (move-human human main-corridor ambulance-corridor)
   deleted: (at human main-corridor)
   added: (at human ambulance-corridor)
   goals met: 1 of 2
8. (move-human human ambulance-corridor consulting-corridor)
   deleted: (at human ambulance-corridor)
   added: (at human consulting-corridor)
   goals met: 1 of 2
9. (move-robot robot waiting-room main-corridor)
   deleted: (at robot waiting-room)
   added: (at robot main-corridor)
   goals met: 1 of 2
10. (move-robot robot main-corridor ambulance-corridor)
   deleted: (at robot main-corridor)
   added: (at robot ambulance-corridor)
   goals met: 1 of 2
11. (move-robot robot ambulance-corridor consulting-corridor)
   deleted: (at robot ambulance-corridor)
   added: (at robot consulting-corridor)
   goals met: 1 of 2
12. (take-patient2doc robot human consulting-corridor consulting-room-1 accompany appt-time)
   deleted: (time4appt appt-time) (at human consulting-corridor) (at robot consulting-corridor)
   added: (move-with-human accompany consulting-room-1) (at robot consulting-room-1) (at human consulting-room-1) (req-done accompany)
   goals met: 2 of 2
